Revit 2027 API
ParameterTypeId.StairsAttrNosingLength Property
 "Nosing Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsAttrNosingLength { get; }
Public Shared ReadOnly Property StairsAttrNosingLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsAttrNosingLength {
	ForgeTypeId^ get ();
}
static member StairsAttrNosingLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace